<a href="https://colab.research.google.com/github/vadim-privalov/Neiroset_Novosibirsk/blob/main/%D0%A0%D0%B0%D0%B1%D0%BE%D1%82%D0%B0_%D1%81_%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86%D0%B0%D0%BC%D0%B8_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85_%D0%BD%D0%B0_%D0%BF%D1%80%D0%B8%D0%BC%D0%B5%D1%80%D0%B5_Pandas_%D0%A7%D0%B0%D1%81%D1%82%D1%8C_1_%D1%80%D0%B0%D0%B7%D0%B1%D0%BE%D1%80_%D0%B4_%D0%B7_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## ООО "Университет Цифровых Технологий платформа 3"

#Работа с таблицами данных на примере Pandas. Часть 1 - разбор д.з.

#Домашнее задание

## Уровень базовый

### Задание 1

импортируйте библиотеку pandas,  выведите на экран номер версии библиотеки

In [ ]:
import pandas as pd # импортируем библиотеку

In [ ]:
print(pd.__version__) # выводим на печать номер версии

1.1.5

### Задание 2

Создайте список из 10 целых чисел.

Из списка создайте объект pd.Series

Bыведине на экран полученный объект pd.Series с без использования print

Bыведине на экран полученный объект pd.Series с использованием функции print

Выведите на экран тип объекта используя встроенную функцию type

Выведите на экран тип значений, хранящихся в объекте pd.Series

Найдите минимальное и максимальное значение.

In [ ]:
l = [7, 6, 5, 5, 4, 3, 100, 22, -100, 0] # создаем список

In [ ]:
ser = pd.Series(l) # создаем объект pd.Series из списка

In [ ]:
ser # посмотрим на объект series

0      7
1      6
2      5
3      5
4      4
5      3
6    100
7     22
8   -100
9      0
dtype: int64

In [ ]:
print(ser) # посмотрим на объект Series

0      7
1      6
2      5
3      5
4      4
5      3
6    100
7     22
8   -100
9      0
dtype: int64

In [ ]:
type(ser) # посмотрим на тип объекта Series

pandas.core.series.Series

In [ ]:
ser.dtype # посмотрим на тип данных в объекте Series

dtype('int64')

In [ ]:
ser.max() # найдем максимальное значение

100

In [ ]:
ser.min() # найдем минимальное значение

-100

### Задание 3

Вы провели серию экспериментов по обучению нейронной сети по задаче классификации.

Результаты занесли в таблицу

> id | N_neurons | Loss | Accurasy
>--- | --- |--- | ---  
> 0 | 16 | 0.15 | 0.95
> 1| 32 | 0.12 | 0.97
> 2| 64 | 0.11 | 0.98
> 3| 128 | 0.13 | 0.96

Создайте три объекта pd.Series, хранящие данные о количестве нейронов, функции потерь (loss) и точности класификации (accuracy).

Из полученных объектов pd.Series создайте DataFrame (подсказка, используйте подход "через словарь")

In [ ]:
N_neurons = pd.Series([16, 32, 64, 128]) # создаем Series для количества нейронов
Loss = pd.Series([0.15, 0.12, 0.11, 0.13]) # создаем Series для значения функции потерь
Accuracy = pd.Series([0.95, 0.97, 0.98, 0.96]) # создаем Series для точности

In [ ]:
# создаем DataFrame из Series "через словарь"
Experiments = pd.DataFrame({'N_neurons' : N_neurons, 
                            'Loss' : Loss, 
                            'Accuracy' : Accuracy})

In [ ]:
Experiments # выведем полученный DataFrame

   N_neurons  Loss  Accuracy
0         16  0.15      0.95
1         32  0.12      0.97
2         64  0.11      0.98
3        128  0.13      0.96

### Задание 4

Для DataFrame, полученного в задании 3 выведите.



1. Первые две строки (записи)
2. Последние две строки
3. Размерность (количество строк и столбцов)
4. Количество элементов
5. Тип объекта
6. Тип любой колонки с данными
7. Информацию о типе колонок и количество непустых значений в каждой колонке.

In [ ]:
Experiments.head(2) # выведем две первые строки

   N_neurons  Loss  Accuracy
0         16  0.15      0.95
1         32  0.12      0.97

In [ ]:
Experiments.tail(2) # выведем две последние строки

   N_neurons  Loss  Accuracy
2         64  0.11      0.98
3        128  0.13      0.96

In [ ]:
Experiments.shape # выыведем размерности нашего DataFrame

(4, 3)

In [ ]:
Experiments.size # выведем количество элементов в нашем DataFrame

12

In [ ]:
type(Experiments) # выведем тип объекта DataFrame

pandas.core.frame.DataFrame

In [ ]:
type(Experiments['N_neurons']) # выведем тип объекта "колонка"

pandas.core.series.Series

In [ ]:
Experiments.info() # выведем сводную информацию о нашем DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   N_neurons  4 non-null      int64
 1   Loss       4 non-null      float64
 2   Accuracy   4 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 224.0 bytes

### Задание 5

Для DataFrame из задания 3 найдите
1. среднее количество нейронов
2. минимальное значение для Loss
3. максимальное значение для Accuracy


Выведите описательные статистики для DataFrame

In [ ]:
Experiments['N_neurons'].mean() # найдем среднее количество нейронов по экспериментам

60.0

In [ ]:
Experiments['Loss'].min() # найдем минимальное значение функции потерь

0.11

In [ ]:
Experiments['Accuracy'].max() # найдем максимальное значение достигнутой точности

0.98

## Уровень Основной

### Задание 1

Загрузите данные по дождям в Австралии из файла weatherAUS.csv
Файл доступен по ссылке.....

Для этого:
1.   Загрузите файл на Google Disk
2.   Подключите Gooogle Disk к сессии Colab
3.   Загрузите данные из файла csv в DataFrame

Убедитесь, что чтение произошло корректно, для этого выведите 3 первых и 3 последних строк полученного DataFrame.

Выведите количество строк и столбцов в полученном DataFrame

In [ ]:
!wget http://dataudt.ru/datasets/weatherAUS.csv

--2021-04-15 13:46:04--  http://dataudt.ru/datasets/weatherAUS.csv
Resolving dataudt.ru (dataudt.ru)... 37.228.117.130
Connecting to dataudt.ru (dataudt.ru)|37.228.117.130|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 14094055 (13M) [application/octet-stream]
Saving to: ‘weatherAUS.csv’

weatherAUS.csv      100%[===================>]  13.44M  3.80MB/s    in 3.5s

2021-04-15 13:46:08 (3.80 MB/s) - ‘weatherAUS.csv’ saved [14094055/14094055]

In [ ]:
df = pd.read_csv('/content/weatherAUS.csv') # прочитаем наш DataFrame из файла

In [ ]:
df.head(3) # выведем три первых строки

         Date Location  MinTemp  ...  Temp3pm  RainToday  RainTomorrow
0  2008-12-01   Albury     13.4  ...     21.8         No            No
1  2008-12-02   Albury      7.4  ...     24.3         No            No
2  2008-12-03   Albury     12.9  ...     23.2         No            No

[3 rows x 23 columns]

In [ ]:
df.tail(3) # выведем три последних строки

              Date Location  MinTemp  ...  Temp3pm  RainToday  RainTomorrow
145457  2017-06-23    Uluru      5.4  ...     26.1         No            No
145458  2017-06-24    Uluru      7.8  ...     26.0         No            No
145459  2017-06-25    Uluru     14.9  ...     20.9         No           NaN

[3 rows x 23 columns]

In [ ]:
df.shape # посмотрим на размерности нашей таблицы

(145460, 23)

### Задание 2

Создайте новый DataFrame, содержащий копию столбцов Date, Location, MinTemp, MaxTemp. 
Выведите информацию о новом DataFrame (колонки, количество и тип объектов)
Посчитайте количество пропусков в колонках MinTemp и MaxTemp.

In [ ]:
df_temp = df[['Date', 'Location', 'MinTemp', 'MaxTemp']].copy() # создадим DataFrame из копий четырех столбцов
df_temp.head() # выведем первые 5 строк новой таблицы

         Date Location  MinTemp  MaxTemp
0  2008-12-01   Albury     13.4     22.9
1  2008-12-02   Albury      7.4     25.1
2  2008-12-03   Albury     12.9     25.7
3  2008-12-04   Albury      9.2     28.0
4  2008-12-05   Albury     17.5     32.3

In [ ]:
df_temp.info() # выведем сводную информацию

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145460 entries, 0 to 145459
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Date      145460 non-null  object
 1   Location  145460 non-null  object
 2   MinTemp   143975 non-null  float64
 3   MaxTemp   144199 non-null  float64
dtypes: float64(2), object(2)
memory usage: 4.4+ MB

In [ ]:
df_temp['MinTemp'].isna().sum() # найдем количество пропусков в колонке MinTemp

1485

In [ ]:
df_temp['MaxTemp'].isna().sum() # найдем количество пропусков в колонке MaxTemp

1261

### Задание 3

1. Выведите описательный статистики для полученного DataFrame
2. Выведите все уникальные значения в колонке Location
3. Выведите количество уникальных занчений в колонке Location

In [ ]:
df_temp.describe() # выведем описательные статистики по числовым признакам

             MinTemp        MaxTemp
count  143975.000000  144199.000000
mean       12.194034      23.221348
std         6.398495       7.119049
min        -8.500000      -4.800000
25%         7.600000      17.900000
50%        12.000000      22.600000
75%        16.900000      28.200000
max        33.900000      48.100000

In [ ]:
df_temp['Location'].unique() # выведем все уникальные значения колонки Location

array(['Albury', 'BadgerysCreek', 'Cobar', 'CoffsHarbour', 'Moree',
       'Newcastle', 'NorahHead', 'NorfolkIsland', 'Penrith', 'Richmond',
       'Sydney', 'SydneyAirport', 'WaggaWagga', 'Williamtown',
       'Wollongong', 'Canberra', 'Tuggeranong', 'MountGinini', 'Ballarat',
       'Bendigo', 'Sale', 'MelbourneAirport', 'Melbourne', 'Mildura',
       'Nhil', 'Portland', 'Watsonia', 'Dartmoor', 'Brisbane', 'Cairns',
       'GoldCoast', 'Townsville', 'Adelaide', 'MountGambier', 'Nuriootpa',
       'Woomera', 'Albany', 'Witchcliffe', 'PearceRAAF', 'PerthAirport',
       'Perth', 'SalmonGums', 'Walpole', 'Hobart', 'Launceston',
       'AliceSprings', 'Darwin', 'Katherine', 'Uluru'], dtype=object)

In [ ]:
df_temp['Location'].nunique() # найдем количество уникальных занчений колонки Location

49

### Задание 4

Cохраните количество строк в DataFrame в переменную.
Удалите все строки, в которых есть хотя-бы один пропуск.
Подсчитайте, сколько строк было удалено.

In [ ]:
rows_old = df_temp.shape[0] # запомним количество строк в нашем DataFrame

In [ ]:
df_temp.dropna(axis=0, how='any', inplace=True) # удалим строки, в которых есть хотя-бы один пропуск

In [ ]:
rows_new = df_temp.shape[0] # проверим, сколько строк осталось в DataFrame

print(f'удалено {rows_old - rows_new} строк') # выведем информацию об удаленных строках

удалено 1881 строк

### Задание 5

Создайте колонку Delta_temp, в которой будет храниться разница между максимальной и минимальное дневными температурами.

In [ ]:
df_temp['Delta_temp'] = df_temp['MaxTemp'] - df_temp['MinTemp'] # создаем нову колонку как разницу между максимальной и минимальной температурами

In [ ]:
df_temp # смотрим на результат

              Date Location  MinTemp  MaxTemp  Delta_temp
0       2008-12-01   Albury     13.4     22.9         9.5
1       2008-12-02   Albury      7.4     25.1        17.7
2       2008-12-03   Albury     12.9     25.7        12.8
3       2008-12-04   Albury      9.2     28.0        18.8
4       2008-12-05   Albury     17.5     32.3        14.8
...            ...      ...      ...      ...         ...
145454  2017-06-20    Uluru      3.5     21.8        18.3
145455  2017-06-21    Uluru      2.8     23.4        20.6
145456  2017-06-22    Uluru      3.6     25.3        21.7
145457  2017-06-23    Uluru      5.4     26.9        21.5
145458  2017-06-24    Uluru      7.8     27.0        19.2

[143579 rows x 5 columns]

## Уровень Продвинутый

### Задание 1

Загрузите базу шоу и фильмов Netflix из файла netflix_titles.csv. В качестве индекса используйте колонку show_id. Выведите первые 5 строк что-бы проверить результат.

Сделайте переиндексацию полученного DataFrame с удалением текущего индекса.
Выведите первые 5 строк полученной таблицы.

In [ ]:
!wget http://dataudt.ru/datasets/netflix_titles.csv

--2021-04-15 13:46:09--  http://dataudt.ru/datasets/netflix_titles.csv
Resolving dataudt.ru (dataudt.ru)... 37.228.117.130
Connecting to dataudt.ru (dataudt.ru)|37.228.117.130|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3000491 (2.9M) [application/octet-stream]
Saving to: ‘netflix_titles.csv’

netflix_titles.csv  100%[===================>]   2.86M  1.22MB/s    in 2.3s

2021-04-15 13:46:13 (1.22 MB/s) - ‘netflix_titles.csv’ saved [3000491/3000491]

In [ ]:
df = pd.read_csv('/content/netflix_titles.csv', index_col='show_id') # загружаем DataFrame
df.head() # смотрим на результат

            type  ...                                        description
show_id           ...
s1       TV Show  ...  In a future where the elite inhabit an island ...
s2         Movie  ...  After a devastating earthquake hits Mexico Cit...
s3         Movie  ...  When an army recruit is found dead, his fellow...
s4         Movie  ...  In a postapocalyptic world, rag-doll robots hi...
s5         Movie  ...  A brilliant group of students become card-coun...

[5 rows x 11 columns]

In [ ]:
df.reset_index(drop=True, inplace=True) # делаем автоматическую переиндексацию с удалением старого индекса
df.head() # смотрим на результат

      type  ...                                        description
0  TV Show  ...  In a future where the elite inhabit an island ...
1    Movie  ...  After a devastating earthquake hits Mexico Cit...
2    Movie  ...  When an army recruit is found dead, his fellow...
3    Movie  ...  In a postapocalyptic world, rag-doll robots hi...
4    Movie  ...  A brilliant group of students become card-coun...

[5 rows x 11 columns]

### Задание 2

1. Выведите информацию о колонках, количестве непустых значений и типе хранимых данных.
2. Заполните пропуске в колонках director и cast значением '' (пустая строка)
3. Заполните пропуски в колонке date_added значением 'January 1, 2020'
4. Найдите самые часто встречающиеся значения в колонках country и rating. Заполните ими пропуски в соответствующих колонках.
5. Повторно выведите информацию о колонках и количестве пропусков что-бы проверить что мы избавились от пустых значений

In [ ]:
df.info() # выведем сводную информацию

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   type          7787 non-null   object
 1   title         7787 non-null   object
 2   director      5398 non-null   object
 3   cast          7069 non-null   object
 4   country       7280 non-null   object
 5   date_added    7777 non-null   object
 6   release_year  7787 non-null   int64
 7   rating        7780 non-null   object
 8   duration      7787 non-null   object
 9   listed_in     7787 non-null   object
 10  description   7787 non-null   object
dtypes: int64(1), object(10)
memory usage: 669.3+ KB

In [ ]:
# заполним пропуски указанными значениями
df['director'].fillna('', inplace=True) 
df['cast'].fillna('', inplace=True)
df['date_added'].fillna('January 1, 2020', inplace=True)
df['country'].fillna('unknown', inplace=True)

In [ ]:
df.rating.mode() # найдем самое популярное значение в колонке rating

0    TV-MA
dtype: object

In [ ]:
df.country.mode() # найдем самое популярное (часто встречающееся) значение в колонке country

0    United States
dtype: object

In [ ]:
rating_mode = df.rating.mode()[0] # сохраним самое популярное значение в колонке rating в переменную
country_mode = df.country.mode()[0] # сохраним самое популярное значение в колонке country в переменную

In [ ]:
# заполним пропуски в колонках rating и country
df['rating'].fillna(rating_mode, inplace=True) 
df['country'].fillna(country_mode, inplace=True)

In [ ]:
df.info() # выведем инфомрацию и убедимся, что всё выполнено хорошо и у нас нет пропусков

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7787 entries, 0 to 7786
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   type          7787 non-null   object
 1   title         7787 non-null   object
 2   director      7787 non-null   object
 3   cast          7787 non-null   object
 4   country       7787 non-null   object
 5   date_added    7787 non-null   object
 6   release_year  7787 non-null   int64
 7   rating        7787 non-null   object
 8   duration      7787 non-null   object
 9   listed_in     7787 non-null   object
 10  description   7787 non-null   object
dtypes: int64(1), object(10)
memory usage: 669.3+ KB

### Задание 3

1. Вычислите количество уникальных записей в колонке country
2. Выведите Топ-5 стран, из которых больше всего шоу в базе.
3. Выведите все шоу, снятые в стране 'Vietnam'
4. Вывелиие все уникальные значения, присутствующие в колонке rating

In [ ]:
df['country'].nunique() # выведем количество уникальных записей в колонке country

682

In [ ]:
df['country'].value_counts()[:5] # выведем топ-5 стран

United States     2555
India              923
unknown            507
United Kingdom     397
Japan              226
Name: country, dtype: int64

In [ ]:
df[df['country'] == 'Vietnam'] # выведем шоу, в которых страна производства равна Vietnam

       type  ...                                        description
939   Movie  ...  A unconventional, efficient Interpol special a...
1482  Movie  ...  In the wake of her husband's betrayal, a novel...
2318  Movie  ...  When traffickers kidnap her daughter from thei...
3105  Movie  ...  A lottery ticket salesperson faces an ethical ...
5654  Movie  ...  From the preparations to the performances, thi...

[5 rows x 11 columns]

In [ ]:
df.rating.unique() # выведем уникальные значения для rating

array(['TV-MA', 'R', 'PG-13', 'TV-14', 'TV-PG', 'NR', 'TV-G', 'TV-Y',
       'TV-Y7', 'PG', 'G', 'NC-17', 'TV-Y7-FV', 'UR'], dtype=object)

### Задание 4

Найдите количество шоу, выпущенных в United States d 2018 году

In [ ]:
mask = (df['country'] == 'United States') & (df['release_year']  == 2018) # создадим маску для нашего условия

In [ ]:
mask.sum() # найдем сумму значений в маске (True преобразовалось в 1, False в 0)

348

In [ ]:
df[mask].head() # посмотрим на DataFrame, если к нему применить маску

        type  ...                                        description
69     Movie  ...  Upping the “13 Cameras” ante, this sequel find...
76     Movie  ...  Student filmmakers uncover occult rituals tied...
125    Movie  ...  A loyal sister struggles to stay afloat while ...
134  TV Show  ...  Witness the excitement and drama behind the sc...
155    Movie  ...  When a grieving teen must work off her debt to...

[5 rows x 11 columns]

In [ ]:
df[mask].shape # выведем количество строк и столбцов

(348, 11)

### Задание 5

Найдите самого продуктивного режиссера в 2019 году (по количеству выпущенных продуктов).

In [ ]:
mask = df['release_year'] == 2019 # создаем булеву маску для нашего условия

In [ ]:
df[mask].director.mode() # находим самого популярного режиссера

0
dtype: object

## Уровень Профессиональный

### Задание 1

Загрузите базу шоу и фильмов Netflix из файла netflix_titles.csv.
Выведите первые 5 строк что-бы проверить результат.
Удалите колонку show_id.
Заполните пропуски в колонке country значением "unknown"

In [ ]:
!wget http://dataudt.ru/datasets/netflix_titles.csv

--2021-04-15 13:46:13--  http://dataudt.ru/datasets/netflix_titles.csv
Resolving dataudt.ru (dataudt.ru)... 37.228.117.130
Connecting to dataudt.ru (dataudt.ru)|37.228.117.130|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 3000491 (2.9M) [application/octet-stream]
Saving to: ‘netflix_titles.csv.1’

netflix_titles.csv. 100%[===================>]   2.86M  1.39MB/s    in 2.1s

2021-04-15 13:46:16 (1.39 MB/s) - ‘netflix_titles.csv.1’ saved [3000491/3000491]

In [ ]:
df = pd.read_csv('/content/netflix_titles.csv') # загружаем DataFrame
df.head() # выведем 5 первых строк

  show_id  ...                                        description
0      s1  ...  In a future where the elite inhabit an island ...
1      s2  ...  After a devastating earthquake hits Mexico Cit...
2      s3  ...  When an army recruit is found dead, his fellow...
3      s4  ...  In a postapocalyptic world, rag-doll robots hi...
4      s5  ...  A brilliant group of students become card-coun...

[5 rows x 12 columns]

In [ ]:
df.drop('show_id' ,axis=1, inplace=True) # удалим колонку show_id
df.head() # проверим результат

      type  ...                                        description
0  TV Show  ...  In a future where the elite inhabit an island ...
1    Movie  ...  After a devastating earthquake hits Mexico Cit...
2    Movie  ...  When an army recruit is found dead, his fellow...
3    Movie  ...  In a postapocalyptic world, rag-doll robots hi...
4    Movie  ...  A brilliant group of students become card-coun...

[5 rows x 11 columns]

In [ ]:
df.country.fillna('unknown', inplace=True) # заполним пропуски в колонке country значением 'unknown'

### Задание 2

Найдите количество уникальных стран, которые присутствуют в колонке country.
Обратите внимание, что в некоторых записях с колонке country перечисляются несколько стран через запятую.

Подсказка - вам может помочь метод df['country'].str.split()

In [ ]:
df['country'].str.split(' ,') # посмотрим, как выглядит результат применения str.split к колонке со странами

0                                                [Brazil]
1                                                [Mexico]
2                                             [Singapore]
3                                         [United States]
4                                         [United States]
                              ...
7782    [Sweden, Czech Republic, United Kingdom, Denma...
7783                                              [India]
7784                                            [unknown]
7785                                          [Australia]
7786              [United Kingdom, Canada, United States]
Name: country, Length: 7787, dtype: object

In [ ]:
unique_countries = set() # здесь будем хранить уникальные страны

for country in df['country'].str.split(', '): # проходим циклом по объекту Series из предыдущей ячейки
    unique_countries.update(set(country)) # добавляем в наш список уникальных стран страны, встреченные в очередной записи

In [ ]:
len(unique_countries) # смотрим, сколько у нас уникальных стран

122

### Задание 3

Найдите среднюю продолжительность фильма в минутах.

In [ ]:
df['duration_0'] = df['duration'].str.split(' ').apply(lambda x: int(x[0])) # в колонку duration_0 записываем число из duration
df['duration_1'] = df['duration'].str.split(' ').apply(lambda x: x[1]) # в колонку duration_1 записываем тип (min или Season) из  duration

In [ ]:
df.head() # посмотрим на результат

      type  title  ... duration_0 duration_1
0  TV Show     3%  ...          4    Seasons
1    Movie   7:19  ...         93        min
2    Movie  23:59  ...         78        min
3    Movie      9  ...         80        min
4    Movie     21  ...        123        min

[5 rows x 13 columns]

In [ ]:
mask = df['type'] == 'Movie' # создадим маску для фильтрации фильмов

In [ ]:
df[mask].duration_0.mean() # найдем среднюю продолжительность фильма в нашей таблице

99.30797842663195